# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y)

x = int(input('Input quarter: '))

if x == 1:
    print('x(0;+ꚙ);y(0;+ꚙ)')
elif x == 2:
    print('x(0;-ꚙ);y(0;+ꚙ)')
elif x == 3:
    print('x(0;-ꚙ);y(0;-ꚙ)')
elif x == 4:
    print('x(0;+ꚙ);y(0;-ꚙ)')
else:
    print('ERROR')